 ![png](bookserd.png)

In [5]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

import json
with open('/Users/austi/.secret/sql_login.json') as f:
    login = json.load(f)
login.keys()

connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/books"
engine = create_engine(connection)
conn = engine.connect()

## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Working on users table

In [6]:
q = """
SELECT * FROM users;
"""

pd.read_sql(q,conn)

Empty DataFrame
Columns: [id, first_name, last_name, email]
Index: []

In [10]:
users = pd.read_csv("Data/users  - users.csv")
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [11]:
# Checking table dtypes to ensure consistent
q = """
DESCRIBE users;
"""

describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [12]:
users.to_sql("users", conn, if_exists='append', index=False)

3

In [13]:
q = """
SELECT * FROM users;
"""

pd.read_sql(q, conn)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

## Working on books table

In [14]:
q = """
SELECT * FROM books;
"""

pd.read_sql(q,conn)

Empty DataFrame
Columns: [id, title, authors_id]
Index: []

In [17]:
books = pd.read_csv("Data/books - books.csv")
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [19]:
# Checking table dtypes to ensure consistent
q = """
DESCRIBE books;
"""

describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1       title  varchar(45)  YES         None
2  authors_id          int   NO  MUL    None

In [21]:
rename_books = {
    "author_id":"authors_id"
}

books.rename(rename_books, axis=1, inplace=True)

books.head()

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4

In [22]:
books.to_sql("books", conn, if_exists='append', index=False)

IntegrityError: (pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`books`.`books`, CONSTRAINT `fk_books_authors` FOREIGN KEY (`authors_id`) REFERENCES `authors` (`id`))')
[SQL: INSERT INTO books (id, title, authors_id) VALUES (%(id)s, %(title)s, %(authors_id)s)]
[parameters: ({'id': 1, 'title': 'The Shining', 'authors_id': 1}, {'id': 2, 'title': 'It', 'authors_id': 1}, {'id': 3, 'title': 'The Great Gatsby', 'authors_id': 2}, {'id': 4, 'title': 'The Call of the Wild', 'authors_id': 3}, {'id': 5, 'title': 'Pride and Prejudice', 'authors_id': 4}, {'id': 6, 'title': 'Frankenstein', 'authors_id': 5})]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [23]:
q = """
SET @@FOREIGN_KEY_CHECKS=0
"""

conn.execute(q)

In [24]:
books.to_sql("books", conn, if_exists='append', index=False)

6

In [25]:
q = """
SELECT * FROM books;
"""

pd.read_sql(q, conn)

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4
5   6          Frankenstein           5

## Working on authors table

In [26]:
q = """
SELECT * FROM authors;
"""

pd.read_sql(q,conn)

Empty DataFrame
Columns: [id, author_name]
Index: []

In [27]:
authors = pd.read_csv("Data/authors - authors.csv")
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [29]:
# Checking table dtypes to ensure consistent
q = """
DESCRIBE authors;
"""

describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [30]:
authors.to_sql("authors", conn, if_exists='append', index=False)

5

In [31]:
q = """
SELECT * FROM authors;
"""

pd.read_sql(q, conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

## Workin on favorites table

In [34]:
q = """
SELECT * FROM favorties;
"""

pd.read_sql(q,conn)

Empty DataFrame
Columns: [users_id, books_id]
Index: []

In [35]:
favorties = pd.read_csv("Data/favorites - favorites.csv")
favorties.info()
favorties.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [38]:
rename_favs = {
    "user_id":"users_id",
    "book_id":"books_id"
}

favorties.rename(rename_favs, axis=1, inplace=True)
favorties.head()

   users_id  books_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5

In [40]:
favorties.to_sql("favorties", conn, if_exists='append', index=False)

7

In [41]:
q = """
SELECT * FROM favorties;
"""

pd.read_sql(q, conn)

   users_id  books_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5
5         3         5
6         3         6

# Testing DB

In [48]:
q = """
SELECT books.title, favorties.users_id
FROM books
JOIN favorties ON books.id = favorties.books_id
WHERE favorties.users_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""

pd.read_sql(q, conn)

              title  users_id
0       The Shining         1
1                It         1
2  The Great Gatsby         1